package LAB_2.tasks.Task7;

/**
 * <h3>Создание классов и интерфейсов для работы с банковскими счетами.</h3>
 * <p>Создайте класс, который представляет банковский счет, и добавьте методы для депозита и снятия денег,
 * а также для получения текущего баланса.</p>
 * <p>Создайте интерфейс, который определяет методы, которые должны быть реализованы для каждого класса,
 * чтобы создать новый банковский счет, совершить транзакции и получить текущий баланс.</p>
 * Реализуйте методы интерфейса в классе банковского счета и создайте объекты для работы с ними в своем приложении.
 */
public class Task7 {
    public static void main(String[] args) {

    }
}
